#설정값과 지역 좌표 등 상수
import os

# 설정값
COOLDOWN_MINUTES = 0.00   #쿨다운   
CONSUMPTION_PER_SEC = 0.5
MAX_CAPACITY = 100.0
OPENAI_API_KEY = "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"

SMTP_SERVER = "smtp.gmail.com"
SMTP_PORT = 587
SENDER_EMAIL = "20210928pm@gmail.com"  
SENDER_PASSWORD = "cgwcmdiwynxqvwys"

# 지역 정보
REGION_COORDS = {
    "서울": {"nx": "60", "ny": "127"},
    
    # [경기도 주요 도시 추가]
    "수원": {"nx": "60", "ny": "121"},
    "성남": {"nx": "61", "ny": "120"},
    "안양": {"nx": "60", "ny": "125"},
    "고양": {"nx": "57", "ny": "128"},
    "용인": {"nx": "62", "ny": "121"},
    "부천": {"nx": "55", "ny": "125"},
    "안산": {"nx": "58", "ny": "121"},
    "남양주": {"nx": "64", "ny": "128"},
    "화성": {"nx": "57", "ny": "119"},
    "평택": {"nx": "62", "ny": "114"},
    "의정부": {"nx": "61", "ny": "129"},
    "파주": {"nx": "56", "ny": "131"},
    "김포": {"nx": "55", "ny": "128"},
    "광명": {"nx": "58", "ny": "125"},
    "광주": {"nx": "65", "ny": "123"},
    "이천": {"nx": "68", "ny": "121"},
    "양주": {"nx": "60", "ny": "121"},
    "구리": {"nx": "61", "ny": "127"},
    "포천": {"nx": "64", "ny": "134"},
    "양평": {"nx": "60", "ny": "121"}, 
    "가평": {"nx": "69", "ny": "133"},
    "시흥": {"nx": "56", "ny": "122"}, 

    "인천": {"nx": "55", "ny": "124"},
    "강원": {"nx": "73", "ny": "134"},
    "충북": {"nx": "69", "ny": "107"},
    "충남": {"nx": "67", "ny": "100"},
    "대전": {"nx": "67", "ny": "100"},
    "세종": {"nx": "67", "ny": "100"},
    "전북": {"nx": "63", "ny": "89"},
    "광주": {"nx": "58", "ny": "74"}, # 전라도 광주
    "전남": {"nx": "58", "ny": "74"},
    "대구": {"nx": "89", "ny": "90"},
    "경북": {"nx": "102", "ny": "94"},
    "울릉도": {"nx": "102", "ny": "115"},
    "경남": {"nx": "98", "ny": "76"},
    "부산": {"nx": "98", "ny": "76"},
    "울산": {"nx": "102", "ny": "84"},
    "제주": {"nx": "52", "ny": "38"}
}
